content/man/man1/systemd.1.org
#+TITLE: Manpages - systemd.1
* NAME
systemd, init - systemd system and service manager

* SYNOPSIS
*/usr/lib/systemd/systemd* [OPTIONS...]

*init* [OPTIONS...] {COMMAND}

* DESCRIPTION
systemd is a system and service manager for Linux operating systems.
When run as first process on boot (as PID 1), it acts as init system
that brings up and maintains userspace services. Separate instances are
started for logged-in users to start their services.

*systemd* is usually not invoked directly by the user, but is installed
as the /sbin/init symlink and started during early boot. The user
manager instances are started automatically through the
*user@.service*(5) service.

For compatibility with SysV, if the binary is called as *init* and is
not the first process on the machine (PID is not 1), it will execute
*telinit* and pass all command line arguments unmodified. That means
*init* and *telinit* are mostly equivalent when invoked from normal
login sessions. See *telinit*(8) for more information.

When run as a system instance, systemd interprets the configuration file
system.conf and the files in system.conf.d directories; when run as a
user instance, systemd interprets the configuration file user.conf and
the files in user.conf.d directories. See *systemd-system.conf*(5) for
more information.

*systemd* contains native implementations of various tasks that need to
be executed as part of the boot process. For example, it sets the
hostname or configures the loopback network device. It also sets up and
mounts various API file systems, such as /sys/, /proc/, and /dev/.

Note that some but not all interfaces provided by systemd are covered by
the *Interface Portability and Stability Promise*[1].

The D-Bus API of *systemd* is described in *org.freedesktop.systemd1*(5)
and *org.freedesktop.LogControl1*(5).

Systems which invoke systemd in a container or initrd environment should
implement the *Container Interface*[2] or *initrd Interface*[3]
specifications, respectively.

