public/man/man1/systemd.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - systemd.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - systemd.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>systemd, init - systemd system and service manager</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>/usr/lib/systemd/systemd</strong> [OPTIONS…]</p>
<p>
<strong>init</strong> [OPTIONS…] {COMMAND}</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>systemd is a system and service manager for Linux operating systems.
When run as first process on boot (as PID 1), it acts as init system
that brings up and maintains userspace services. Separate instances are
started for logged-in users to start their services.</p>
<p>
<strong>systemd</strong> is usually not invoked directly by the user, but is installed
as the /sbin/init symlink and started during early boot. The user
manager instances are started automatically through the
*user@.service*(5) service.</p>
<p>
For compatibility with SysV, if the binary is called as <strong>init</strong> and is
not the first process on the machine (PID is not 1), it will execute
<strong>telinit</strong> and pass all command line arguments unmodified. That means
<strong>init</strong> and <strong>telinit</strong> are mostly equivalent when invoked from normal
login sessions. See *telinit*(8) for more information.</p>
<p>
When run as a system instance, systemd interprets the configuration file
system.conf and the files in system.conf.d directories; when run as a
user instance, systemd interprets the configuration file user.conf and
the files in user.conf.d directories. See *systemd-system.conf*(5) for
more information.</p>
<p>
<strong>systemd</strong> contains native implementations of various tasks that need to
be executed as part of the boot process. For example, it sets the
hostname or configures the loopback network device. It also sets up and
mounts various API file systems, such as <em>sys</em>, <em>proc</em>, and <em>dev</em>.</p>
<p>
Note that some but not all interfaces provided by systemd are covered by
the <strong>Interface Portability and Stability Promise</strong>[1].</p>
<p>
The D-Bus API of <strong>systemd</strong> is described in *org.freedesktop.systemd1*(5)
and *org.freedesktop.LogControl1*(5).</p>
<p>
Systems which invoke systemd in a container or initrd environment should
implement the <strong>Container Interface</strong>[2] or <strong>initrd Interface</strong>[3]
specifications, respectively.</p>
</div>
</div>
