content/man/man1/systemd.1.org
* DIRECTORIES
System unit directories

#+begin_quote
The systemd system manager reads unit configuration from various
directories. Packages that want to install unit files shall place them
in the directory returned by *pkg-config systemd
--variable=systemdsystemunitdir*. Other directories checked are
/usr/local/lib/systemd/system and /usr/lib/systemd/system. User
configuration always takes precedence. *pkg-config systemd
--variable=systemdsystemconfdir* returns the path of the system
configuration directory. Packages should alter the content of these
directories only with the *enable* and *disable* commands of the
*systemctl*(1) tool. Full list of directories is provided in
*systemd.unit*(5).

#+end_quote

User unit directories

#+begin_quote
Similar rules apply for the user unit directories. However, here the
*XDG Base Directory specification*[5] is followed to find units.
Applications should place their unit files in the directory returned by
*pkg-config systemd --variable=systemduserunitdir*. Global configuration
is done in the directory reported by *pkg-config systemd
--variable=systemduserconfdir*. The *enable* and *disable* commands of
the *systemctl*(1) tool can handle both global (i.e. for all users) and
private (for one user) enabling/disabling of units. Full list of
directories is provided in *systemd.unit*(5).

#+end_quote

SysV init scripts directory

#+begin_quote
The location of the SysV init script directory varies between
distributions. If systemd cannot find a native unit file for a requested
service, it will look for a SysV init script of the same name (with the
.service suffix removed).

#+end_quote

SysV runlevel link farm directory

#+begin_quote
The location of the SysV runlevel link farm directory varies between
distributions. systemd will take the link farm into account when
figuring out whether a service shall be enabled. Note that a service
unit with a native unit configuration file cannot be started by
activating it in the SysV runlevel link farm.

#+end_quote

