public/man/man1/systemd.1/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
DIRECTORIES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>System unit directories</p>
<blockquote>
<p>The systemd system manager reads unit configuration from various
directories. Packages that want to install unit files shall place them
in the directory returned by <strong>pkg-config systemd
–variable=systemdsystemunitdir</strong>. Other directories checked are
/usr/local/lib/systemd/system and /usr/lib/systemd/system. User
configuration always takes precedence. <strong>pkg-config systemd
–variable=systemdsystemconfdir</strong> returns the path of the system
configuration directory. Packages should alter the content of these
directories only with the <strong>enable</strong> and <strong>disable</strong> commands of the
*systemctl*(1) tool. Full list of directories is provided in
*systemd.unit*(5).</p>
</blockquote>
<p>
User unit directories</p>
<blockquote>
<p>Similar rules apply for the user unit directories. However, here the
<strong>XDG Base Directory specification</strong>[5] is followed to find units.
Applications should place their unit files in the directory returned by
<strong>pkg-config systemd –variable=systemduserunitdir</strong>. Global configuration
is done in the directory reported by <strong>pkg-config systemd
–variable=systemduserconfdir</strong>. The <strong>enable</strong> and <strong>disable</strong> commands of
the *systemctl*(1) tool can handle both global (i.e. for all users) and
private (for one user) enabling/disabling of units. Full list of
directories is provided in *systemd.unit*(5).</p>
</blockquote>
<p>
SysV init scripts directory</p>
<blockquote>
<p>The location of the SysV init script directory varies between
distributions. If systemd cannot find a native unit file for a requested
service, it will look for a SysV init script of the same name (with the
.service suffix removed).</p>
</blockquote>
<p>
SysV runlevel link farm directory</p>
<blockquote>
<p>The location of the SysV runlevel link farm directory varies between
distributions. systemd will take the link farm into account when
figuring out whether a service shall be enabled. Note that a service
unit with a native unit configuration file cannot be started by
activating it in the SysV runlevel link farm.</p>
</blockquote>
</div>
</div>
