content/man/man1/systemd.1.org
* SIGNALS
The service listens to various UNIX process signals that can be used to
request various actions asynchronously. The signal handling is enabled
very early during boot, before any further processes are invoked.
However, a supervising container manager or similar that intends to
request these operations via this mechanism must take into consideration
that this functionality is not available during the earliest
initialization phase. An *sd_notify()* notification message carrying the
/X_SYSTEMD_SIGNALS_LEVEL=2/ field is emitted once the signal handlers
are enabled, see below. This may be used to schedule submission of these
signals correctly.

*SIGTERM*

#+begin_quote
Upon receiving this signal the systemd system manager serializes its
state, reexecutes itself and deserializes the saved state again. This is
mostly equivalent to *systemctl daemon-reexec*.

systemd user managers will start the exit.target unit when this signal
is received. This is mostly equivalent to *systemctl --user start
exit.target --job-mode=replace-irreversibly*.

#+end_quote

*SIGINT*

#+begin_quote
Upon receiving this signal the systemd system manager will start the
ctrl-alt-del.target unit. This is mostly equivalent to *systemctl start
ctrl-alt-del.target --job-mode=replace-irreversibly*. If this signal is
received more than 7 times per 2s, an immediate reboot is triggered.
Note that pressing Ctrl+Alt+Del on the console will trigger this signal.
Hence, if a reboot is hanging, pressing Ctrl+Alt+Del more than 7 times
in 2 seconds is a relatively safe way to trigger an immediate reboot.

systemd user managers treat this signal the same way as *SIGTERM*.

#+end_quote

*SIGWINCH*

#+begin_quote
When this signal is received the systemd system manager will start the
kbrequest.target unit. This is mostly equivalent to *systemctl start
kbrequest.target*.

This signal is ignored by systemd user managers.

#+end_quote

*SIGPWR*

#+begin_quote
When this signal is received the systemd manager will start the
sigpwr.target unit. This is mostly equivalent to *systemctl start
sigpwr.target*.

#+end_quote

*SIGUSR1*

#+begin_quote
When this signal is received the systemd manager will try to reconnect
to the D-Bus bus.

#+end_quote

*SIGUSR2*

#+begin_quote
When this signal is received the systemd manager will log its complete
state in human-readable form. The data logged is the same as printed by
*systemd-analyze dump*.

#+end_quote

*SIGHUP*

#+begin_quote
Reloads the complete daemon configuration. This is mostly equivalent to
*systemctl daemon-reload*.

#+end_quote

*SIGRTMIN+0*

#+begin_quote
Enters default mode, starts the default.target unit. This is mostly
equivalent to *systemctl isolate default.target*.

#+end_quote

*SIGRTMIN+1*

#+begin_quote
Enters rescue mode, starts the rescue.target unit. This is mostly
equivalent to *systemctl isolate rescue.target*.

#+end_quote

*SIGRTMIN+2*

#+begin_quote
Enters emergency mode, starts the emergency.service unit. This is mostly
equivalent to *systemctl isolate emergency.service*.

#+end_quote

*SIGRTMIN+3*

#+begin_quote
Halts the machine, starts the halt.target unit. This is mostly
equivalent to *systemctl start halt.target
--job-mode=replace-irreversibly*.

#+end_quote

*SIGRTMIN+4*

#+begin_quote
Powers off the machine, starts the poweroff.target unit. This is mostly
equivalent to *systemctl start poweroff.target
--job-mode=replace-irreversibly*.

#+end_quote

*SIGRTMIN+5*

#+begin_quote
Reboots the machine, starts the reboot.target unit. This is mostly
equivalent to *systemctl start reboot.target
--job-mode=replace-irreversibly*.

#+end_quote

*SIGRTMIN+6*

#+begin_quote
Reboots the machine via kexec, starts the kexec.target unit. This is
mostly equivalent to *systemctl start kexec.target
--job-mode=replace-irreversibly*.

#+end_quote

*SIGRTMIN+7*

#+begin_quote
Reboots userspace, starts the soft-reboot.target unit. This is mostly
equivalent to *systemctl start soft-reboot.target
--job-mode=replace-irreversibly*.

Added in version 254.

#+end_quote

*SIGRTMIN+13*

#+begin_quote
Immediately halts the machine.

#+end_quote

*SIGRTMIN+14*

#+begin_quote
Immediately powers off the machine.

#+end_quote

*SIGRTMIN+15*

#+begin_quote
Immediately reboots the machine.

#+end_quote

*SIGRTMIN+16*

#+begin_quote
Immediately reboots the machine with kexec.

#+end_quote

*SIGRTMIN+17*

#+begin_quote
Immediately reboots the userspace.

Added in version 254.

#+end_quote

*SIGRTMIN+20*

#+begin_quote
Enables display of status messages on the console, as controlled via
/systemd.show_status=1/ on the kernel command line.

#+end_quote

*SIGRTMIN+21*

#+begin_quote
Disables display of status messages on the console, as controlled via
/systemd.show_status=0/ on the kernel command line.

#+end_quote

*SIGRTMIN+22*

#+begin_quote
Sets the service managers log level to "debug", in a fashion equivalent
to /systemd.log_level=debug/ on the kernel command line.

#+end_quote

*SIGRTMIN+23*

#+begin_quote
Restores the log level to its configured value. The configured value is
derived from -- in order of priority -- the value specified with
/systemd.log-level=/ on the kernel command line, or the value specified
with *LogLevel=* in the configuration file, or the built-in default of
"info".

Added in version 239.

#+end_quote

*SIGRTMIN+24*

#+begin_quote
Immediately exits the manager (only available for --user instances).

Added in version 195.

#+end_quote

*SIGRTMIN+25*

#+begin_quote
Upon receiving this signal the systemd manager will reexecute itself.
This is mostly equivalent to *systemctl daemon-reexec* except that it
will be done asynchronously.

The systemd system manager treats this signal the same way as *SIGTERM*.

Added in version 250.

#+end_quote

*SIGRTMIN+26*

#+begin_quote
Restores the log target to its configured value. The configured value is
derived from -- in order of priority -- the value specified with
/systemd.log-target=/ on the kernel command line, or the value specified
with *LogTarget=* in the configuration file, or the built-in default.

Added in version 239.

#+end_quote

*SIGRTMIN+27*, *SIGRTMIN+28*

#+begin_quote
Sets the log target to "console" on *SIGRTMIN+27* (or "kmsg" on
*SIGRTMIN+28*), in a fashion equivalent to /systemd.log_target=console/
(or /systemd.log_target=kmsg/ on *SIGRTMIN+28*) on the kernel command
line.

Added in version 239.

#+end_quote

