public/man/man1/systemd.1/index.html
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SIGNALS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The service listens to various UNIX process signals that can be used to
request various actions asynchronously. The signal handling is enabled
very early during boot, before any further processes are invoked.
However, a supervising container manager or similar that intends to
request these operations via this mechanism must take into consideration
that this functionality is not available during the earliest
initialization phase. An <strong>sd_notify()</strong> notification message carrying the
<em>X_SYSTEMD_SIGNALS_LEVEL=2</em> field is emitted once the signal handlers
are enabled, see below. This may be used to schedule submission of these
signals correctly.</p>
<p>
<strong>SIGTERM</strong></p>
<blockquote>
<p>Upon receiving this signal the systemd system manager serializes its
state, reexecutes itself and deserializes the saved state again. This is
mostly equivalent to <strong>systemctl daemon-reexec</strong>.</p>
<p>
systemd user managers will start the exit.target unit when this signal
is received. This is mostly equivalent to <strong>systemctl –user start
exit.target –job-mode=replace-irreversibly</strong>.</p>
</blockquote>
<p>
<strong>SIGINT</strong></p>
<blockquote>
<p>Upon receiving this signal the systemd system manager will start the
ctrl-alt-del.target unit. This is mostly equivalent to <strong>systemctl start
ctrl-alt-del.target –job-mode=replace-irreversibly</strong>. If this signal is
received more than 7 times per 2s, an immediate reboot is triggered.
Note that pressing Ctrl+Alt+Del on the console will trigger this signal.
Hence, if a reboot is hanging, pressing Ctrl+Alt+Del more than 7 times
in 2 seconds is a relatively safe way to trigger an immediate reboot.</p>
<p>
systemd user managers treat this signal the same way as <strong>SIGTERM</strong>.</p>
</blockquote>
<p>
<strong>SIGWINCH</strong></p>
<blockquote>
<p>When this signal is received the systemd system manager will start the
kbrequest.target unit. This is mostly equivalent to <strong>systemctl start
kbrequest.target</strong>.</p>
<p>
This signal is ignored by systemd user managers.</p>
</blockquote>
<p>
<strong>SIGPWR</strong></p>
<blockquote>
<p>When this signal is received the systemd manager will start the
sigpwr.target unit. This is mostly equivalent to <strong>systemctl start
sigpwr.target</strong>.</p>
</blockquote>
<p>
<strong>SIGUSR1</strong></p>
<blockquote>
<p>When this signal is received the systemd manager will try to reconnect
to the D-Bus bus.</p>
</blockquote>
<p>
<strong>SIGUSR2</strong></p>
<blockquote>
<p>When this signal is received the systemd manager will log its complete
state in human-readable form. The data logged is the same as printed by
<strong>systemd-analyze dump</strong>.</p>
</blockquote>
<p>
<strong>SIGHUP</strong></p>
<blockquote>
<p>Reloads the complete daemon configuration. This is mostly equivalent to
<strong>systemctl daemon-reload</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+0</strong></p>
<blockquote>
<p>Enters default mode, starts the default.target unit. This is mostly
equivalent to <strong>systemctl isolate default.target</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+1</strong></p>
<blockquote>
<p>Enters rescue mode, starts the rescue.target unit. This is mostly
equivalent to <strong>systemctl isolate rescue.target</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+2</strong></p>
<blockquote>
<p>Enters emergency mode, starts the emergency.service unit. This is mostly
equivalent to <strong>systemctl isolate emergency.service</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+3</strong></p>
<blockquote>
<p>Halts the machine, starts the halt.target unit. This is mostly
equivalent to <strong>systemctl start halt.target
–job-mode=replace-irreversibly</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+4</strong></p>
<blockquote>
<p>Powers off the machine, starts the poweroff.target unit. This is mostly
equivalent to <strong>systemctl start poweroff.target
–job-mode=replace-irreversibly</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+5</strong></p>
<blockquote>
<p>Reboots the machine, starts the reboot.target unit. This is mostly
equivalent to <strong>systemctl start reboot.target
–job-mode=replace-irreversibly</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+6</strong></p>
<blockquote>
<p>Reboots the machine via kexec, starts the kexec.target unit. This is
mostly equivalent to <strong>systemctl start kexec.target
–job-mode=replace-irreversibly</strong>.</p>
</blockquote>
<p>
<strong>SIGRTMIN+7</strong></p>
<blockquote>
<p>Reboots userspace, starts the soft-reboot.target unit. This is mostly
equivalent to <strong>systemctl start soft-reboot.target
–job-mode=replace-irreversibly</strong>.</p>
<p>
Added in version 254.</p>
</blockquote>
<p>
<strong>SIGRTMIN+13</strong></p>
<blockquote>
<p>Immediately halts the machine.</p>
</blockquote>
<p>
<strong>SIGRTMIN+14</strong></p>
<blockquote>
<p>Immediately powers off the machine.</p>
</blockquote>
<p>
<strong>SIGRTMIN+15</strong></p>
<blockquote>
<p>Immediately reboots the machine.</p>
</blockquote>
<p>
<strong>SIGRTMIN+16</strong></p>
<blockquote>
<p>Immediately reboots the machine with kexec.</p>
</blockquote>
<p>
<strong>SIGRTMIN+17</strong></p>
<blockquote>
<p>Immediately reboots the userspace.</p>
<p>
Added in version 254.</p>
</blockquote>
<p>
<strong>SIGRTMIN+20</strong></p>
<blockquote>
<p>Enables display of status messages on the console, as controlled via
<em>systemd.show_status=1</em> on the kernel command line.</p>
</blockquote>
<p>
<strong>SIGRTMIN+21</strong></p>
<blockquote>
<p>Disables display of status messages on the console, as controlled via
<em>systemd.show_status=0</em> on the kernel command line.</p>
</blockquote>
<p>
<strong>SIGRTMIN+22</strong></p>
<blockquote>
<p>Sets the service managers log level to &#34;debug&#34;, in a fashion equivalent
to <em>systemd.log_level=debug</em> on the kernel command line.</p>
</blockquote>
<p>
<strong>SIGRTMIN+23</strong></p>
<blockquote>
<p>Restores the log level to its configured value. The configured value is
derived from – in order of priority – the value specified with
<em>systemd.log-level=</em> on the kernel command line, or the value specified
with <strong>LogLevel=</strong> in the configuration file, or the built-in default of
&#34;info&#34;.</p>
<p>
Added in version 239.</p>
</blockquote>
<p>
<strong>SIGRTMIN+24</strong></p>
<blockquote>
<p>Immediately exits the manager (only available for –user instances).</p>
<p>
Added in version 195.</p>
</blockquote>
<p>
<strong>SIGRTMIN+25</strong></p>
<blockquote>
<p>Upon receiving this signal the systemd manager will reexecute itself.
This is mostly equivalent to <strong>systemctl daemon-reexec</strong> except that it
will be done asynchronously.</p>
<p>
The systemd system manager treats this signal the same way as <strong>SIGTERM</strong>.</p>
<p>
Added in version 250.</p>
</blockquote>
<p>
<strong>SIGRTMIN+26</strong></p>
<blockquote>
<p>Restores the log target to its configured value. The configured value is
derived from – in order of priority – the value specified with
<em>systemd.log-target=</em> on the kernel command line, or the value specified
with <strong>LogTarget=</strong> in the configuration file, or the built-in default.</p>
<p>
Added in version 239.</p>
</blockquote>
<p>
<strong>SIGRTMIN+27</strong>, <strong>SIGRTMIN+28</strong></p>
<blockquote>
<p>Sets the log target to &#34;console&#34; on <strong>SIGRTMIN+27</strong> (or &#34;kmsg&#34; on
<strong>SIGRTMIN+28</strong>), in a fashion equivalent to <em>systemd.log_target=console</em>
(or <em>systemd.log_target=kmsg</em> on <strong>SIGRTMIN+28</strong>) on the kernel command
line.</p>
<p>
Added in version 239.</p>
</blockquote>
</div>
</div>
