public/man/man1/systemd.1/index.html
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
ENVIRONMENT
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>The environment block for the system manager is initially set by the
kernel. (In particular, &#34;key=value&#34; assignments on the kernel command
line are turned into environment variables for PID 1). For the user
manager, the system manager sets the environment as described in the
&#34;Environment Variables in Spawned Processes&#34; section of
*systemd.exec*(5). The <em>DefaultEnvironment=</em> setting in the system
manager applies to all services including user@.service. Additional
entries may be configured (as for any other service) through the
<em>Environment=</em> and <em>EnvironmentFile=</em> settings for user@.service (see
*systemd.exec*(5)). Also, additional environment variables may be set
through the <em>ManagerEnvironment=</em> setting in *systemd-system.conf*(5)
and *systemd-user.conf*(5).</p>
<p>
Some of the variables understood by <strong>systemd</strong>:</p>
<p>
<em>$SYSTEMD_LOG_LEVEL</em></p>
<blockquote>
<p>The maximum log level of emitted messages (messages with a higher log
level, i.e. less important ones, will be suppressed). Takes a
comma-separated list of values. A value may be either one of (in order
of decreasing importance) <strong>emerg</strong>, <strong>alert</strong>, <strong>crit</strong>, <strong>err</strong>, <strong>warning</strong>,
<strong>notice</strong>, <strong>info</strong>, <strong>debug</strong>, or an integer in the range 0…7. See
<strong>syslog*(3) for more information. Each value may optionally be prefixed
with one of *console</strong>, <strong>syslog</strong>, <strong>kmsg</strong> or <strong>journal</strong> followed by a colon
to set the maximum log level for that specific log target (e.g.
<strong>SYSTEMD_LOG_LEVEL=debug,console:info</strong> specifies to log at debug level
except when logging to the console which should be at info level). Note
that the global maximum log level takes priority over any per target
maximum log levels.</p>
<p>
This can be overridden with <strong>–log-level=</strong>.</p>
</blockquote>
<p>
<em>$SYSTEMD_LOG_COLOR</em></p>
<blockquote>
<p>A boolean. If true, messages written to the tty will be colored
according to priority.</p>
<p>
This can be overridden with <strong>–log-color=</strong>.</p>
</blockquote>
<p>
<em>$SYSTEMD_LOG_TIME</em></p>
<blockquote>
<p>A boolean. If true, console log messages will be prefixed with a
timestamp.</p>
<p>
This can be overridden with <strong>–log-time=</strong>.</p>
<p>
Added in version 246.</p>
</blockquote>
<p>
<em>$SYSTEMD_LOG_LOCATION</em></p>
<blockquote>
<p>A boolean. If true, messages will be prefixed with a filename and line
number in the source code where the message originates.</p>
<p>
This can be overridden with <strong>–log-location=</strong>.</p>
</blockquote>
<p>
<em>$SYSTEMD_LOG_TID</em></p>
<blockquote>
<p>A boolean. If true, messages will be prefixed with the current numerical
thread ID (TID).</p>
<p>
Added in version 247.</p>
</blockquote>
<p>
<em>$SYSTEMD_LOG_TARGET</em></p>
<blockquote>
<p>The destination for log messages. One of <strong>console</strong> (log to the attached
tty), <strong>console-prefixed</strong> (log to the attached tty but with prefixes
encoding the log level and &#34;facility&#34;, see <strong>syslog*(3), *kmsg</strong> (log to
the kernel circular log buffer), <strong>journal</strong> (log to the journal),
<strong>journal-or-kmsg</strong> (log to the journal if available, and to kmsg
otherwise), <strong>auto</strong> (determine the appropriate log target automatically,
the default), <strong>null</strong> (disable log output).</p>
<p>
This can be overridden with <strong>–log-target=</strong>.</p>
</blockquote>
<p>
<em>$SYSTEMD_LOG_RATELIMIT_KMSG</em></p>
<blockquote>
<p>Whether to ratelimit kmsg or not. Takes a boolean. Defaults to &#34;true&#34;.
If disabled, systemd will not ratelimit messages written to kmsg.</p>
<p>
Added in version 254.</p>
</blockquote>
<p>
<em>$XDG_CONFIG_HOME</em>, <em>$XDG_CONFIG_DIRS</em>, <em>$XDG_DATA_HOME</em>,
<em>$XDG_DATA_DIRS</em></p>
<blockquote>
<p>The systemd user manager uses these variables in accordance to the <strong>XDG
Base Directory specification</strong>[5] to find its configuration.</p>
</blockquote>
<p>
<em>$SYSTEMD_UNIT_PATH</em>, <em>$SYSTEMD_GENERATOR_PATH</em>,
<em>$SYSTEMD_ENVIRONMENT_GENERATOR_PATH</em></p>
<blockquote>
<p>Controls where systemd looks for unit files and generators.</p>
<p>
These variables may contain a list of paths, separated by colons (&#34;:&#34;).
When set, if the list ends with an empty component (&#34;…:&#34;), this list
is prepended to the usual set of paths. Otherwise, the specified list
replaces the usual set of paths.</p>
</blockquote>
<p>
<em>$SYSTEMD_PAGER</em></p>
<blockquote>
<p>Pager to use when <strong>–no-pager</strong> is not given; overrides <em>$PAGER</em>. If
neither <em>$SYSTEMD_PAGER</em> nor <em>$PAGER</em> are set, a set of well-known pager
implementations are tried in turn, including *less*(1) and *more*(1),
until one is found. If no pager implementation is discovered no pager is
invoked. Setting this environment variable to an empty string or the
value &#34;cat&#34; is equivalent to passing <strong>–no-pager</strong>.</p>
<p>
Note: if <em>$SYSTEMD_PAGERSECURE</em> is not set, <em>$SYSTEMD_PAGER</em> (as well as
<em>$PAGER</em>) will be silently ignored.</p>
</blockquote>
<p>
<em>$SYSTEMD_LESS</em></p>
<blockquote>
<p>Override the options passed to <strong>less</strong> (by default &#34;FRSXMK&#34;).</p>
<p>
Users might want to change two options in particular:</p>
<p>
<strong>K</strong></p>
<blockquote>
<p>This option instructs the pager to exit immediately when Ctrl+C is
pressed. To allow <strong>less</strong> to handle Ctrl+C itself to switch back to the
pager command prompt, unset this option.</p>
<p>
If the value of <em>$SYSTEMD_LESS</em> does not include &#34;K&#34;, and the pager that
is invoked is <strong>less</strong>, Ctrl+C will be ignored by the executable, and
needs to be handled by the pager.</p>
</blockquote>
<p>
<strong>X</strong></p>
<blockquote>
<p>This option instructs the pager to not send termcap initialization and
deinitialization strings to the terminal. It is set by default to allow
command output to remain visible in the terminal even after the pager
exits. Nevertheless, this prevents some pager functionality from
working, in particular paged output cannot be scrolled with the mouse.</p>
</blockquote>
<p>
Note that setting the regular <em>$LESS</em> environment variable has no effect
for <strong>less</strong> invocations by systemd tools.</p>
<p>
See *less*(1) for more discussion.</p>
</blockquote>
<p>
<em>$SYSTEMD_LESSCHARSET</em></p>
<blockquote>
<p>Override the charset passed to <strong>less</strong> (by default &#34;utf-8&#34;, if the
invoking terminal is determined to be UTF-8 compatible).</p>
<p>
Note that setting the regular <em>$LESSCHARSET</em> environment variable has no
effect for <strong>less</strong> invocations by systemd tools.</p>
</blockquote>
<p>
<em>$SYSTEMD_PAGERSECURE</em></p>
<blockquote>
<p>Takes a boolean argument. When true, the &#34;secure&#34; mode of the pager is
enabled; if false, disabled. If <em>$SYSTEMD_PAGERSECURE</em> is not set at
all, secure mode is enabled if the effective UID is not the same as the
owner of the login session, see <strong>geteuid*(2) and
*sd_pid_get_owner_uid*(3). In secure mode, *LESSSECURE=1</strong> will be set
when invoking the pager, and the pager shall disable commands that open
or create new files or start new subprocesses. When
<em>$SYSTEMD_PAGERSECURE</em> is not set at all, pagers which are not known to
implement secure mode will not be used. (Currently only *less*(1)
implements secure mode.)</p>
<p>
Note: when commands are invoked with elevated privileges, for example
under *sudo*(8) or *pkexec*(1), care must be taken to ensure that
unintended interactive features are not enabled. &#34;Secure&#34; mode for the
pager may be enabled automatically as describe above. Setting
<em>SYSTEMD_PAGERSECURE=0</em> or not removing it from the inherited
environment allows the user to invoke arbitrary commands. Note that if
the <em>$SYSTEMD_PAGER</em> or <em>$PAGER</em> variables are to be honoured,
<em>$SYSTEMD_PAGERSECURE</em> must be set too. It might be reasonable to
completely disable the pager using <strong>–no-pager</strong> instead.</p>
</blockquote>
<p>
<em>$SYSTEMD_COLORS</em></p>
<blockquote>
<p>Takes a boolean argument. When true, <strong>systemd</strong> and related utilities
will use colors in their output, otherwise the output will be
monochrome. Additionally, the variable can take one of the following
special values: &#34;16&#34;, &#34;256&#34; to restrict the use of colors to the base 16
or 256 ANSI colors, respectively. This can be specified to override the
automatic decision based on <em>$TERM</em> and what the console is connected
to.</p>
</blockquote>
<p>
<em>$SYSTEMD_URLIFY</em></p>
<blockquote>
<p>The value must be a boolean. Controls whether clickable links should be
generated in the output for terminal emulators supporting this. This can
be specified to override the decision that <strong>systemd</strong> makes based on
<em>$TERM</em> and other conditions.</p>
</blockquote>
<p>
<em>$LISTEN_PID</em>, <em>$LISTEN_FDS</em>, <em>$LISTEN_FDNAMES</em></p>
<blockquote>
<p>Set by systemd for supervised processes during socket-based activation.
See *sd_listen_fds*(3) for more information.</p>
</blockquote>
<p>
<em>$NOTIFY_SOCKET</em></p>
<blockquote>
<p>Set by service manager for its services for status and readiness
notifications. Also consumed by service manager for notifying
supervising container managers or service managers up the stack about
its own progress. See *sd_notify*(3) and the relevant section below for
more information.</p>
</blockquote>
<p>
For further environment variables understood by systemd and its various
components, see <strong>Known Environment Variables</strong>[6].</p>
</div>
</div>
