content/man/man1/systemd.1.org
* KERNEL COMMAND LINE
When run as the system instance, systemd parses a number of options
listed below. They can be specified as kernel command line arguments
which are parsed from a number of sources depending on the environment
in which systemd is executed. If run inside a Linux container, these
options are parsed from the command line arguments passed to systemd
itself, next to any of the command line options listed in the Options
section above. If run outside of Linux containers, these arguments are
parsed from /proc/cmdline and from the "SystemdOptions" EFI variable (on
EFI systems) instead. Options from /proc/cmdline have higher priority.

Note: use of "SystemdOptions" is deprecated.

The following variables are understood:

/systemd.unit=/, /rd.systemd.unit=/

#+begin_quote
Overrides the unit to activate on boot. Defaults to default.target. This
may be used to temporarily boot into a different boot unit, for example
rescue.target or emergency.service. See *systemd.special*(7) for details
about these units. The option prefixed with "rd." is honored only in the
initrd, while the one that is not prefixed only in the main system.

#+end_quote

/systemd.dump_core/

#+begin_quote
Takes a boolean argument or enables the option if specified without an
argument. If enabled, the systemd manager (PID 1) dumps core when it
crashes. Otherwise, no core dump is created. Defaults to enabled.

Added in version 233.

#+end_quote

/systemd.crash_chvt/

#+begin_quote
Takes a positive integer, or a boolean argument. Can be also specified
without an argument, with the same effect as a positive boolean. If a
positive integer (in the range 1--63) is specified, the system manager
(PID 1) will activate the specified virtual terminal when it crashes.
Defaults to disabled, meaning that no such switch is attempted. If set
to enabled, the virtual terminal the kernel messages are written to is
used instead.

Added in version 233.

#+end_quote

/systemd.crash_shell/

#+begin_quote
Takes a boolean argument or enables the option if specified without an
argument. If enabled, the system manager (PID 1) spawns a shell when it
crashes, after a 10s delay. Otherwise, no shell is spawned. Defaults to
disabled, for security reasons, as the shell is not protected by
password authentication.

Added in version 233.

#+end_quote

/systemd.crash_action=/

#+begin_quote
Takes one of "freeze", "reboot" or "poweroff". Defaults to "freeze". If
set to "freeze", the system will hang indefinitely when the system
manager (PID 1) crashes. If set to "reboot", the system manager (PID 1)
will reboot the machine automatically when it crashes, after a 10s
delay. If set to "poweroff", the system manager (PID 1) will power off
the machine immediately when it crashes. If combined with
/systemd.crash_shell/, the configured crash action is executed after the
shell exits.

Added in version 256.

#+end_quote

/systemd.confirm_spawn/

#+begin_quote
Takes a boolean argument or a path to the virtual console where the
confirmation messages should be emitted. Can be also specified without
an argument, with the same effect as a positive boolean. If enabled, the
system manager (PID 1) asks for confirmation when spawning processes
using */dev/console*. If a path or a console name (such as "ttyS0") is
provided, the virtual console pointed to by this path or described by
the give name will be used instead. Defaults to disabled.

Added in version 233.

#+end_quote

/systemd.service_watchdogs=/

#+begin_quote
Takes a boolean argument. If disabled, all service runtime watchdogs
(*WatchdogSec=*) and emergency actions (e.g. *OnFailure=* or
*StartLimitAction=*) are ignored by the system manager (PID 1); see
*systemd.service*(5). Defaults to enabled, i.e. watchdogs and failure
actions are processed normally. The hardware watchdog is not affected by
this option.

Added in version 237.

#+end_quote

/systemd.show_status/

#+begin_quote
Takes a boolean argument or the constants *error* and *auto*. Can be
also specified without an argument, with the same effect as a positive
boolean. If enabled, the systemd manager (PID 1) shows terse service
status updates on the console during bootup. With *error*, only messages
about failures are shown, but boot is otherwise quiet. *auto* behaves
like *false* until there is a significant delay in boot. Defaults to
enabled, unless *quiet* is passed as kernel command line option, in
which case it defaults to *error*. If specified overrides the system
manager configuration file option *ShowStatus=*, see
*systemd-system.conf*(5).

Added in version 233.

#+end_quote

/systemd.status_unit_format=/

#+begin_quote
Takes *name*, *description* or *combined* as the value. If *name*, the
system manager will use unit names in status messages. If *combined*,
the system manager will use unit names and description in status
messages. When specified, overrides the system manager configuration
file option *StatusUnitFormat=*, see *systemd-system.conf*(5).

Added in version 243.

#+end_quote

/systemd.log_color/, /systemd.log_level=/, /systemd.log_location/,
/systemd.log_target=/, /systemd.log_time/, /systemd.log_tid/,
/systemd.log_ratelimit_kmsg/

#+begin_quote
Controls log output, with the same effect as the /$SYSTEMD_LOG_COLOR/,
/$SYSTEMD_LOG_LEVEL/, /$SYSTEMD_LOG_LOCATION/, /$SYSTEMD_LOG_TARGET/,
/$SYSTEMD_LOG_TIME/, /$SYSTEMD_LOG_TID/ and
/$SYSTEMD_LOG_RATELIMIT_KMSG/ environment variables described above.
/systemd.log_color/, /systemd.log_location/, /systemd.log_time/,
/systemd.log_tid/ and /systemd.log_ratelimit_kmsg/ can be specified
without an argument, with the same effect as a positive boolean.

#+end_quote

/systemd.default_standard_output=/, /systemd.default_standard_error=/

#+begin_quote
Controls default standard output and error output for services and
sockets. That is, controls the default for *StandardOutput=* and
*StandardError=* (see *systemd.exec*(5) for details). Takes one of
*inherit*, *null*, *tty*, *journal*, *journal+console*, *kmsg*,
*kmsg+console*. If the argument is omitted
/systemd.default-standard-output=/ defaults to *journal* and
/systemd.default-standard-error=/ to *inherit*.

#+end_quote

/systemd.setenv=/

#+begin_quote
Takes a string argument in the form VARIABLE=VALUE. May be used to set
default environment variables to add to forked child processes. May be
used more than once to set multiple variables.

#+end_quote

/systemd.machine_id=/

#+begin_quote
Takes a 32 character hex value to be used for setting the machine-id.
Intended mostly for network booting where the same machine-id is desired
for every boot.

Added in version 229.

#+end_quote

/systemd.set_credential=/, /systemd.set_credential_binary=/

#+begin_quote
Sets a system credential, which can then be propagated to system
services using the /ImportCredential=/ or /LoadCredential=/ setting, see
*systemd.exec*(5) for details. Takes a pair of credential name and
value, separated by a colon. The /systemd.set_credential=/ parameter
expects the credential value in literal text form, the
/systemd.set_credential_binary=/ parameter takes binary data encoded in
Base64. Note that the kernel command line is typically accessible by
unprivileged programs in /proc/cmdline. Thus, this mechanism is not
suitable for transferring sensitive data. Use it only for data that is
not sensitive (e.g. public keys/certificates, rather than private keys),
or in testing/debugging environments.

For further information see *System and Service Credentials*[7]
documentation.

Added in version 251.

#+end_quote

/systemd.import_credentials=/

#+begin_quote
Takes a boolean argument. If false disables importing credentials from
the kernel command line, the DMI/SMBIOS OEM string table, the
qemu_fw_cfg subsystem or the EFI kernel stub.

Added in version 251.

#+end_quote

/quiet/

#+begin_quote
Turn off status output at boot, much like /systemd.show_status=no/
would. Note that this option is also read by the kernel itself and
disables kernel log output. Passing this option hence turns off the
usual output from both the system manager and the kernel.

Added in version 186.

#+end_quote

/debug/

#+begin_quote
Turn on debugging output. This is equivalent to
/systemd.log_level=debug/. Note that this option is also read by the
kernel itself and enables kernel debug output. Passing this option hence
turns on the debug output from both the system manager and the kernel.

Added in version 205.

#+end_quote

/emergency/, /rd.emergency/, /-b/

#+begin_quote
Boot into emergency mode. This is equivalent to
/systemd.unit=emergency.target/ or /rd.systemd.unit=emergency.target/,
respectively, and provided for compatibility reasons and to be easier to
type.

Added in version 186.

#+end_quote

/rescue/, /rd.rescue/, /single/, /s/, /S/, /1/

#+begin_quote
Boot into rescue mode. This is equivalent to
/systemd.unit=rescue.target/ or /rd.systemd.unit=rescue.target/,
respectively, and provided for compatibility reasons and to be easier to
type.

Added in version 186.

#+end_quote

/2/, /3/, /4/, /5/

#+begin_quote
Boot into the specified legacy SysV runlevel. These are equivalent to
/systemd.unit=runlevel2.target/, /systemd.unit=runlevel3.target/,
/systemd.unit=runlevel4.target/, and /systemd.unit=runlevel5.target/,
respectively, and provided for compatibility reasons and to be easier to
type.

Added in version 186.

#+end_quote

/locale.LANG=/, /locale.LANGUAGE=/, /locale.LC_CTYPE=/,
/locale.LC_NUMERIC=/, /locale.LC_TIME=/, /locale.LC_COLLATE=/,
/locale.LC_MONETARY=/, /locale.LC_MESSAGES=/, /locale.LC_PAPER=/,
/locale.LC_NAME=/, /locale.LC_ADDRESS=/, /locale.LC_TELEPHONE=/,
/locale.LC_MEASUREMENT=/, /locale.LC_IDENTIFICATION=/

#+begin_quote
Set the system locale to use. This overrides the settings in
/etc/locale.conf. For more information, see *locale.conf*(5) and
*locale*(7).

Added in version 186.

#+end_quote

For other kernel command line parameters understood by components of the
core OS, please refer to *kernel-command-line*(7).

