public/man/man1/systemd.1/index.html
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
KERNEL COMMAND LINE
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>When run as the system instance, systemd parses a number of options
listed below. They can be specified as kernel command line arguments
which are parsed from a number of sources depending on the environment
in which systemd is executed. If run inside a Linux container, these
options are parsed from the command line arguments passed to systemd
itself, next to any of the command line options listed in the Options
section above. If run outside of Linux containers, these arguments are
parsed from /proc/cmdline and from the &#34;SystemdOptions&#34; EFI variable (on
EFI systems) instead. Options from /proc/cmdline have higher priority.</p>
<p>
Note: use of &#34;SystemdOptions&#34; is deprecated.</p>
<p>
The following variables are understood:</p>
<p>
<em>systemd.unit=</em>, <em>rd.systemd.unit=</em></p>
<blockquote>
<p>Overrides the unit to activate on boot. Defaults to default.target. This
may be used to temporarily boot into a different boot unit, for example
rescue.target or emergency.service. See *systemd.special*(7) for details
about these units. The option prefixed with &#34;rd.&#34; is honored only in the
initrd, while the one that is not prefixed only in the main system.</p>
</blockquote>
<p>
<em>systemd.dump_core</em></p>
<blockquote>
<p>Takes a boolean argument or enables the option if specified without an
argument. If enabled, the systemd manager (PID 1) dumps core when it
crashes. Otherwise, no core dump is created. Defaults to enabled.</p>
<p>
Added in version 233.</p>
</blockquote>
<p>
<em>systemd.crash_chvt</em></p>
<blockquote>
<p>Takes a positive integer, or a boolean argument. Can be also specified
without an argument, with the same effect as a positive boolean. If a
positive integer (in the range 1–63) is specified, the system manager
(PID 1) will activate the specified virtual terminal when it crashes.
Defaults to disabled, meaning that no such switch is attempted. If set
to enabled, the virtual terminal the kernel messages are written to is
used instead.</p>
<p>
Added in version 233.</p>
</blockquote>
<p>
<em>systemd.crash_shell</em></p>
<blockquote>
<p>Takes a boolean argument or enables the option if specified without an
argument. If enabled, the system manager (PID 1) spawns a shell when it
crashes, after a 10s delay. Otherwise, no shell is spawned. Defaults to
disabled, for security reasons, as the shell is not protected by
password authentication.</p>
<p>
Added in version 233.</p>
</blockquote>
<p>
<em>systemd.crash_action=</em></p>
<blockquote>
<p>Takes one of &#34;freeze&#34;, &#34;reboot&#34; or &#34;poweroff&#34;. Defaults to &#34;freeze&#34;. If
set to &#34;freeze&#34;, the system will hang indefinitely when the system
manager (PID 1) crashes. If set to &#34;reboot&#34;, the system manager (PID 1)
will reboot the machine automatically when it crashes, after a 10s
delay. If set to &#34;poweroff&#34;, the system manager (PID 1) will power off
the machine immediately when it crashes. If combined with
<em>systemd.crash_shell</em>, the configured crash action is executed after the
shell exits.</p>
<p>
Added in version 256.</p>
</blockquote>
<p>
<em>systemd.confirm_spawn</em></p>
<blockquote>
<p>Takes a boolean argument or a path to the virtual console where the
confirmation messages should be emitted. Can be also specified without
an argument, with the same effect as a positive boolean. If enabled, the
system manager (PID 1) asks for confirmation when spawning processes
using <strong>/dev/console</strong>. If a path or a console name (such as &#34;ttyS0&#34;) is
provided, the virtual console pointed to by this path or described by
the give name will be used instead. Defaults to disabled.</p>
<p>
Added in version 233.</p>
</blockquote>
<p>
<em>systemd.service_watchdogs=</em></p>
<blockquote>
<p>Takes a boolean argument. If disabled, all service runtime watchdogs
(<strong>WatchdogSec=</strong>) and emergency actions (e.g. <strong>OnFailure=</strong> or
<strong>StartLimitAction=</strong>) are ignored by the system manager (PID 1); see
*systemd.service*(5). Defaults to enabled, i.e. watchdogs and failure
actions are processed normally. The hardware watchdog is not affected by
this option.</p>
<p>
Added in version 237.</p>
</blockquote>
<p>
<em>systemd.show_status</em></p>
<blockquote>
<p>Takes a boolean argument or the constants <strong>error</strong> and <strong>auto</strong>. Can be
also specified without an argument, with the same effect as a positive
boolean. If enabled, the systemd manager (PID 1) shows terse service
status updates on the console during bootup. With <strong>error</strong>, only messages
about failures are shown, but boot is otherwise quiet. <strong>auto</strong> behaves
like <strong>false</strong> until there is a significant delay in boot. Defaults to
enabled, unless <strong>quiet</strong> is passed as kernel command line option, in
which case it defaults to <strong>error</strong>. If specified overrides the system
manager configuration file option <strong>ShowStatus=</strong>, see
*systemd-system.conf*(5).</p>
<p>
Added in version 233.</p>
</blockquote>
<p>
<em>systemd.status_unit_format=</em></p>
<blockquote>
<p>Takes <strong>name</strong>, <strong>description</strong> or <strong>combined</strong> as the value. If <strong>name</strong>, the
system manager will use unit names in status messages. If <strong>combined</strong>,
the system manager will use unit names and description in status
messages. When specified, overrides the system manager configuration
file option <strong>StatusUnitFormat=</strong>, see *systemd-system.conf*(5).</p>
<p>
Added in version 243.</p>
</blockquote>
<p>
<em>systemd.log_color</em>, <em>systemd.log_level=</em>, <em>systemd.log_location</em>,
<em>systemd.log_target=</em>, <em>systemd.log_time</em>, <em>systemd.log_tid</em>,
<em>systemd.log_ratelimit_kmsg</em></p>
<blockquote>
<p>Controls log output, with the same effect as the <em>$SYSTEMD_LOG_COLOR</em>,
<em>$SYSTEMD_LOG_LEVEL</em>, <em>$SYSTEMD_LOG_LOCATION</em>, <em>$SYSTEMD_LOG_TARGET</em>,
<em>$SYSTEMD_LOG_TIME</em>, <em>$SYSTEMD_LOG_TID</em> and
<em>$SYSTEMD_LOG_RATELIMIT_KMSG</em> environment variables described above.
<em>systemd.log_color</em>, <em>systemd.log_location</em>, <em>systemd.log_time</em>,
<em>systemd.log_tid</em> and <em>systemd.log_ratelimit_kmsg</em> can be specified
without an argument, with the same effect as a positive boolean.</p>
</blockquote>
<p>
<em>systemd.default_standard_output=</em>, <em>systemd.default_standard_error=</em></p>
<blockquote>
<p>Controls default standard output and error output for services and
sockets. That is, controls the default for <strong>StandardOutput=</strong> and
<strong>StandardError=</strong> (see <strong>systemd.exec*(5) for details). Takes one of
*inherit</strong>, <strong>null</strong>, <strong>tty</strong>, <strong>journal</strong>, <strong>journal+console</strong>, <strong>kmsg</strong>,
<strong>kmsg+console</strong>. If the argument is omitted
<em>systemd.default-standard-output=</em> defaults to <strong>journal</strong> and
<em>systemd.default-standard-error=</em> to <strong>inherit</strong>.</p>
</blockquote>
<p>
<em>systemd.setenv=</em></p>
<blockquote>
<p>Takes a string argument in the form VARIABLE=VALUE. May be used to set
default environment variables to add to forked child processes. May be
used more than once to set multiple variables.</p>
</blockquote>
<p>
<em>systemd.machine_id=</em></p>
<blockquote>
<p>Takes a 32 character hex value to be used for setting the machine-id.
Intended mostly for network booting where the same machine-id is desired
for every boot.</p>
<p>
Added in version 229.</p>
</blockquote>
<p>
<em>systemd.set_credential=</em>, <em>systemd.set_credential_binary=</em></p>
<blockquote>
<p>Sets a system credential, which can then be propagated to system
services using the <em>ImportCredential=</em> or <em>LoadCredential=</em> setting, see
*systemd.exec*(5) for details. Takes a pair of credential name and
value, separated by a colon. The <em>systemd.set_credential=</em> parameter
expects the credential value in literal text form, the
<em>systemd.set_credential_binary=</em> parameter takes binary data encoded in
Base64. Note that the kernel command line is typically accessible by
unprivileged programs in /proc/cmdline. Thus, this mechanism is not
suitable for transferring sensitive data. Use it only for data that is
not sensitive (e.g. public keys/certificates, rather than private keys),
or in testing/debugging environments.</p>
<p>
For further information see <strong>System and Service Credentials</strong>[7]
documentation.</p>
<p>
Added in version 251.</p>
</blockquote>
<p>
<em>systemd.import_credentials=</em></p>
<blockquote>
<p>Takes a boolean argument. If false disables importing credentials from
the kernel command line, the DMI/SMBIOS OEM string table, the
qemu_fw_cfg subsystem or the EFI kernel stub.</p>
<p>
Added in version 251.</p>
</blockquote>
<p>
<em>quiet</em></p>
<blockquote>
<p>Turn off status output at boot, much like <em>systemd.show_status=no</em>
would. Note that this option is also read by the kernel itself and
disables kernel log output. Passing this option hence turns off the
usual output from both the system manager and the kernel.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<em>debug</em></p>
<blockquote>
<p>Turn on debugging output. This is equivalent to
<em>systemd.log_level=debug</em>. Note that this option is also read by the
kernel itself and enables kernel debug output. Passing this option hence
turns on the debug output from both the system manager and the kernel.</p>
<p>
Added in version 205.</p>
</blockquote>
<p>
<em>emergency</em>, <em>rd.emergency</em>, <em>-b</em></p>
<blockquote>
<p>Boot into emergency mode. This is equivalent to
<em>systemd.unit=emergency.target</em> or <em>rd.systemd.unit=emergency.target</em>,
respectively, and provided for compatibility reasons and to be easier to
type.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<em>rescue</em>, <em>rd.rescue</em>, <em>single</em>, <em>s</em>, <em>S</em>, <em>1</em></p>
<blockquote>
<p>Boot into rescue mode. This is equivalent to
<em>systemd.unit=rescue.target</em> or <em>rd.systemd.unit=rescue.target</em>,
respectively, and provided for compatibility reasons and to be easier to
type.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<em>2</em>, <em>3</em>, <em>4</em>, <em>5</em></p>
<blockquote>
<p>Boot into the specified legacy SysV runlevel. These are equivalent to
<em>systemd.unit=runlevel2.target</em>, <em>systemd.unit=runlevel3.target</em>,
<em>systemd.unit=runlevel4.target</em>, and <em>systemd.unit=runlevel5.target</em>,
respectively, and provided for compatibility reasons and to be easier to
type.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<em>locale.LANG=</em>, <em>locale.LANGUAGE=</em>, <em>locale.LC_CTYPE=</em>,
<em>locale.LC_NUMERIC=</em>, <em>locale.LC_TIME=</em>, <em>locale.LC_COLLATE=</em>,
<em>locale.LC_MONETARY=</em>, <em>locale.LC_MESSAGES=</em>, <em>locale.LC_PAPER=</em>,
<em>locale.LC_NAME=</em>, <em>locale.LC_ADDRESS=</em>, <em>locale.LC_TELEPHONE=</em>,
<em>locale.LC_MEASUREMENT=</em>, <em>locale.LC_IDENTIFICATION=</em></p>
<blockquote>
<p>Set the system locale to use. This overrides the settings in
/etc/locale.conf. For more information, see *locale.conf*(5) and
*locale*(7).</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
For other kernel command line parameters understood by components of the
core OS, please refer to *kernel-command-line*(7).</p>
</div>
</div>
