content/man/man1/systemd.1.org
* SYSTEM CREDENTIALS
During initialization the service manager will import credentials from
various sources into the systems set of credentials, which can then be
propagated into services and consumed by generators:

#+begin_quote
·

When the service manager first initializes it will read system
credentials from SMBIOS Type 11 vendor strings
/io.systemd.credential:name=value/, and
/io.systemd.credential.binary:name=value/.

#+end_quote

#+begin_quote
·

At the same time it will import credentials from QEMU "fw_cfg". (Note
that the SMBIOS mechanism is generally preferred, because it is faster
and generic.)

#+end_quote

#+begin_quote
·

Credentials may be passed via the kernel command line, using the
/systemd.set-credential=/ parameter, see above.

#+end_quote

#+begin_quote
·

Credentials may be passed from the UEFI environment via
*systemd-stub*(7).

#+end_quote

#+begin_quote
·

When the service manager is invoked during the initrd → host transition
it will import all files in /run/credentials/@initrd/ as system
credentials.

#+end_quote

Invoke *systemd-creds*(1) as follows to see the list of credentials
passed into the system:

#+begin_quote
#+begin_example
# systemd-creds --system list
#+end_example

#+end_quote

For further information see *System and Service Credentials*[7]
documentation.

The service manager when run as PID 1 consumes the following system
credentials:

/vmm.notify_socket/

#+begin_quote
Contains a *AF_VSOCK* or *AF_UNIX* address where to send a *READY=1*
notification message when the service manager has completed booting. See
*sd_notify*(3) and the next section for more information. Note that in
case the hypervisor does not support *SOCK_DGRAM* over *AF_VSOCK*,
*SOCK_SEQPACKET* will be tried instead. The credential payload for
*AF_VSOCK* should be a string in the form "vsock:CID:PORT".
"vsock-stream", "vsock-dgram" and "vsock-seqpacket" can be used instead
of "vsock" to force usage of the corresponding socket type.

This feature is useful for machine managers or other processes on the
host to receive a notification via VSOCK when a virtual machine has
finished booting.

Added in version 254.

#+end_quote

/system.machine_id/

#+begin_quote
Takes a 128bit hexadecimal ID to initialize /etc/machine-id from, if the
file is not set up yet. See *machine-id*(5) for details.

Added in version 254.

#+end_quote

For a list of system credentials various other components of systemd
consume, see *systemd.system-credentials*(7).

* READINESS PROTOCOL
The service manager implements a readiness notification protocol both
between the manager and its services (i.e. down the stack), and between
the manager and a potential supervisor further up the stack (the latter
could be a machine or container manager, or in case of a per-user
service manager the system service manager instance). The basic protocol
(and the suggested API for it) is described in *sd_notify*(3).

The notification socket the service manager (including PID 1) uses for
reporting readiness to its own supervisor is set via the usual
/$NOTIFY_SOCKET/ environment variable (see above). Since this is
directly settable only for container managers and for the per-user
instance of the service manager, an additional mechanism to configure
this is available, in particular intended for use in VM environments:
the /vmm.notify_socket/ system credential (see above) may be set to a
suitable socket (typically an *AF_VSOCK* one) via SMBIOS Type 11 vendor
strings. For details see above.

The notification protocol from the service manager up the stack towards
a supervisor supports a number of extension fields that allow a
supervisor to learn about specific properties of the system and track
its boot progress. Specifically the following fields are sent:

#+begin_quote
·

An /X_SYSTEMD_HOSTNAME=.../ message will be sent out once the initial
hostname for the system has been determined. Note that during later
runtime the hostname might be changed again programmatically, and
(currently) no further notifications are sent out in that case.

Added in version 256.

#+end_quote

#+begin_quote
·

An /X_SYSTEMD_MACHINE_ID=.../ message will be sent out once the machine
ID of the system has been determined. See *machine-id*(5) for details.

Added in version 256.

#+end_quote

#+begin_quote
·

An /X_SYSTEMD_SIGNALS_LEVEL=.../ message will be sent out once the
service manager installed the various UNIX process signal handlers
described above. The fields value is an unsigned integer formatted as
decimal string, and indicates the supported UNIX process signal feature
level of the service manager. Currently, only a single feature level is
defined:

#+begin_quote
·

/X_SYSTEMD_SIGNALS_LEVEL=2/ covers the various UNIX process signals
documented above -- which are a superset of those supported by the
historical SysV init system.

#+end_quote

Signals sent to PID 1 before this message is sent might not be handled
correctly yet. A consumer of these messages should parse the value as an
unsigned integer indication the level of support. For now only the
mentioned level 2 is defined, but later on additional levels might be
defined with higher integers, that will implement a superset of the
currently defined behaviour.

Added in version 256.

#+end_quote

#+begin_quote
·

/X_SYSTEMD_UNIT_ACTIVE=.../ and /X_SYSTEMD_UNIT_INACTIVE=.../ messages
will be sent out for each target unit as it becomes active or stops
being active. This is useful to track boot progress and functionality.
For example, once the ssh-access.target unit is reported started SSH
access is typically available, see *systemd.special*(7) for details.

Added in version 256.

#+end_quote

#+begin_quote
·

An /X_SYSTEMD_SHUTDOWN=.../ message will be sent out very shortly before
the system shuts down. The value is one of the strings "reboot", "halt",
"poweroff", "kexec" and indicates which kind of shutdown is being
executed.

Added in version 256.

#+end_quote

#+begin_quote
·

An /X_SYSTEMD_REBOOT_PARAMETER=.../ message will also be sent out very
shortly before the system shuts down. Its value is the reboot argument
as configured with *systemctl --reboot-argument=...*.

Added in version 256.

#+end_quote

Note that these extension fields are sent in addition to the regular
"READY=1" and "RELOADING=1" notifications.

* OPTIONS
*systemd* is only very rarely invoked directly, since it is started
early and is already running by the time users may interact with it.
Normally, tools like *systemctl*(1) are used to give commands to the
manager. Since *systemd* is usually not invoked directly, the options
listed below are mostly useful for debugging and special purposes.

