public/man/man1/systemd.1/index.html
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
SYSTEM CREDENTIALS
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>During initialization the service manager will import credentials from
various sources into the systems set of credentials, which can then be
propagated into services and consumed by generators:</p>
<blockquote>
<p>·</p>
<p>
When the service manager first initializes it will read system
credentials from SMBIOS Type 11 vendor strings
<em>io.systemd.credential:name=value</em>, and
<em>io.systemd.credential.binary:name=value</em>.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
At the same time it will import credentials from QEMU &#34;fw_cfg&#34;. (Note
that the SMBIOS mechanism is generally preferred, because it is faster
and generic.)</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Credentials may be passed via the kernel command line, using the
<em>systemd.set-credential=</em> parameter, see above.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Credentials may be passed from the UEFI environment via
*systemd-stub*(7).</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
When the service manager is invoked during the initrd → host transition
it will import all files in <em>run/credentials/@initrd</em> as system
credentials.</p>
</blockquote>
<p>
Invoke *systemd-creds*(1) as follows to see the list of credentials
passed into the system:</p>
<blockquote>
<pre class="example">
# systemd-creds --system list
</pre>
</blockquote>
<p>
For further information see <strong>System and Service Credentials</strong>[7]
documentation.</p>
<p>
The service manager when run as PID 1 consumes the following system
credentials:</p>
<p>
<em>vmm.notify_socket</em></p>
<blockquote>
<p>Contains a <strong>AF_VSOCK</strong> or <strong>AF_UNIX</strong> address where to send a <strong>READY=1</strong>
notification message when the service manager has completed booting. See
<strong>sd_notify*(3) and the next section for more information. Note that in
case the hypervisor does not support *SOCK_DGRAM</strong> over <strong>AF_VSOCK</strong>,
<strong>SOCK_SEQPACKET</strong> will be tried instead. The credential payload for
<strong>AF_VSOCK</strong> should be a string in the form &#34;vsock:CID:PORT&#34;.
&#34;vsock-stream&#34;, &#34;vsock-dgram&#34; and &#34;vsock-seqpacket&#34; can be used instead
of &#34;vsock&#34; to force usage of the corresponding socket type.</p>
<p>
This feature is useful for machine managers or other processes on the
host to receive a notification via VSOCK when a virtual machine has
finished booting.</p>
<p>
Added in version 254.</p>
</blockquote>
<p>
<em>system.machine_id</em></p>
<blockquote>
<p>Takes a 128bit hexadecimal ID to initialize /etc/machine-id from, if the
file is not set up yet. See *machine-id*(5) for details.</p>
<p>
Added in version 254.</p>
</blockquote>
<p>
For a list of system credentials various other components of systemd
consume, see *systemd.system-credentials*(7).</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
READINESS PROTOCOL
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>The service manager implements a readiness notification protocol both
between the manager and its services (i.e. down the stack), and between
the manager and a potential supervisor further up the stack (the latter
could be a machine or container manager, or in case of a per-user
service manager the system service manager instance). The basic protocol
(and the suggested API for it) is described in *sd_notify*(3).</p>
<p>
The notification socket the service manager (including PID 1) uses for
reporting readiness to its own supervisor is set via the usual
<em>$NOTIFY_SOCKET</em> environment variable (see above). Since this is
directly settable only for container managers and for the per-user
instance of the service manager, an additional mechanism to configure
this is available, in particular intended for use in VM environments:
the <em>vmm.notify_socket</em> system credential (see above) may be set to a
suitable socket (typically an <strong>AF_VSOCK</strong> one) via SMBIOS Type 11 vendor
strings. For details see above.</p>
<p>
The notification protocol from the service manager up the stack towards
a supervisor supports a number of extension fields that allow a
supervisor to learn about specific properties of the system and track
its boot progress. Specifically the following fields are sent:</p>
<blockquote>
<p>·</p>
<p>
An <em>X_SYSTEMD_HOSTNAME=…</em> message will be sent out once the initial
hostname for the system has been determined. Note that during later
runtime the hostname might be changed again programmatically, and
(currently) no further notifications are sent out in that case.</p>
<p>
Added in version 256.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
An <em>X_SYSTEMD_MACHINE_ID=…</em> message will be sent out once the machine
ID of the system has been determined. See *machine-id*(5) for details.</p>
<p>
Added in version 256.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
An <em>X_SYSTEMD_SIGNALS_LEVEL=…</em> message will be sent out once the
service manager installed the various UNIX process signal handlers
described above. The fields value is an unsigned integer formatted as
decimal string, and indicates the supported UNIX process signal feature
level of the service manager. Currently, only a single feature level is
defined:</p>
<blockquote>
<p>·</p>
<p>
<em>X_SYSTEMD_SIGNALS_LEVEL=2</em> covers the various UNIX process signals
documented above – which are a superset of those supported by the
historical SysV init system.</p>
</blockquote>
<p>
Signals sent to PID 1 before this message is sent might not be handled
correctly yet. A consumer of these messages should parse the value as an
unsigned integer indication the level of support. For now only the
mentioned level 2 is defined, but later on additional levels might be
defined with higher integers, that will implement a superset of the
currently defined behaviour.</p>
<p>
Added in version 256.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>X_SYSTEMD_UNIT_ACTIVE=…</em> and <em>X_SYSTEMD_UNIT_INACTIVE=…</em> messages
will be sent out for each target unit as it becomes active or stops
being active. This is useful to track boot progress and functionality.
For example, once the ssh-access.target unit is reported started SSH
access is typically available, see *systemd.special*(7) for details.</p>
<p>
Added in version 256.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
An <em>X_SYSTEMD_SHUTDOWN=…</em> message will be sent out very shortly before
the system shuts down. The value is one of the strings &#34;reboot&#34;, &#34;halt&#34;,
&#34;poweroff&#34;, &#34;kexec&#34; and indicates which kind of shutdown is being
executed.</p>
<p>
Added in version 256.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
An <em>X_SYSTEMD_REBOOT_PARAMETER=…</em> message will also be sent out very
shortly before the system shuts down. Its value is the reboot argument
as configured with <strong>systemctl –reboot-argument=…</strong>.</p>
<p>
Added in version 256.</p>
</blockquote>
<p>
Note that these extension fields are sent in addition to the regular
&#34;READY=1&#34; and &#34;RELOADING=1&#34; notifications.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
OPTIONS
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p><strong>systemd</strong> is only very rarely invoked directly, since it is started
early and is already running by the time users may interact with it.
Normally, tools like <strong>systemctl*(1) are used to give commands to the
manager. Since *systemd</strong> is usually not invoked directly, the options
listed below are mostly useful for debugging and special purposes.</p>
