content/man/man1/systemd.1.org
** Introspection and debugging options
Those options are used for testing and introspection, and *systemd* may
be invoked with them at any time:

*--dump-configuration-items*

#+begin_quote
Dump understood unit configuration items. This outputs a terse but
complete list of configuration items understood in unit definition
files.

#+end_quote

*--dump-bus-properties*

#+begin_quote
Dump exposed bus properties. This outputs a terse but complete list of
properties exposed on D-Bus.

Added in version 239.

#+end_quote

*--test*

#+begin_quote
Determine the initial start-up transaction (i.e. the list of jobs
enqueued at start-up), dump it and exit --- without actually executing
any of the determined jobs. This option is useful for debugging only.
Note that during regular service manager start-up additional units not
shown by this operation may be started, because hardware, socket, bus or
other kinds of activation might add additional jobs as the transaction
is executed. Use *--system* to request the initial transaction of the
system service manager (this is also the implied default), combine with
*--user* to request the initial transaction of the per-user service
manager instead.

#+end_quote

*--system*, *--user*

#+begin_quote
When used in conjunction with *--test*, selects whether to calculate the
initial transaction for the system instance or for a per-user instance.
These options have no effect when invoked without *--test*, as during
regular (i.e. non-*--test*) invocations the service manager will
automatically detect whether it shall operate in system or per-user
mode, by checking whether the PID it is run as is 1 or not. Note that it
is not supported booting and maintaining a system with the service
manager running in *--system* mode but with a PID other than 1.

#+end_quote

*-h*, *--help*

#+begin_quote
Print a short help text and exit.

#+end_quote

*--version*

#+begin_quote
Print a short version string and exit.

#+end_quote

** Options that duplicate kernel command line settings
Those options correspond directly to options listed above in "Kernel
Command Line". Both forms may be used equivalently for the system
manager, but it is recommended to use the forms listed above in this
context, because they are properly namespaced. When an option is
specified both on the kernel command line and as a normal command line
argument, the latter has higher precedence.

When *systemd* is used as a user manager, the kernel command line is
ignored and only the options described below are understood.
Nevertheless, *systemd* is usually started in this mode through the
*user@.service*(5) service, which is shared between all users. It may be
more convenient to use configuration files to modify settings (see
*systemd-user.conf*(5)), or environment variables. See the "Environment"
section above for a discussion of how the environment block is set.

*--unit=*

#+begin_quote
Set default unit to activate on startup. If not specified, defaults to
default.target. See /systemd.unit=/ above.

#+end_quote

*--dump-core*

#+begin_quote
Enable core dumping on crash. This switch has no effect when running as
user instance. Same as /systemd.dump_core=/ above.

#+end_quote

*--crash-vt=*/VT/

#+begin_quote
Switch to a specific virtual console (VT) on crash. This switch has no
effect when running as user instance. Same as /systemd.crash_chvt=/
above (but not the different spelling!).

Added in version 227.

#+end_quote

*--crash-shell*

#+begin_quote
Run a shell on crash. This switch has no effect when running as user
instance. See /systemd.crash_shell=/ above.

#+end_quote

*--crash-action=*

#+begin_quote
Specify what to do when the system manager (PID 1) crashes. This switch
has no effect when systemd is running as user instance. See
/systemd.crash_action=/ above.

Added in version 256.

#+end_quote

*--confirm-spawn*

#+begin_quote
Ask for confirmation when spawning processes. This switch has no effect
when run as user instance. See /systemd.confirm_spawn/ above.

#+end_quote

*--show-status*

#+begin_quote
Show terse unit status information on the console during boot-up and
shutdown. See /systemd.show_status/ above.

Added in version 244.

#+end_quote

*--log-color*

#+begin_quote
Highlight important log messages. See /systemd.log_color/ above.

Added in version 244.

#+end_quote

*--log-level=*

#+begin_quote
Set log level. See /systemd.log_level/ above.

#+end_quote

*--log-location*

#+begin_quote
Include code location in log messages. See /systemd.log_location/ above.

Added in version 244.

#+end_quote

*--log-target=*

#+begin_quote
Set log target. See /systemd.log_target/ above.

#+end_quote

*--log-time=*

#+begin_quote
Prefix console messages with timestamp. See /systemd.log_time/ above.

Added in version 246.

#+end_quote

*--machine-id=*

#+begin_quote
Override the machine-id set on the hard drive. See /systemd.machine_id=/
above.

Added in version 229.

#+end_quote

*--service-watchdogs*

#+begin_quote
Globally enable/disable all service watchdog timeouts and emergency
actions. See /systemd.service_watchdogs/ above.

Added in version 237.

#+end_quote

*--default-standard-output=*, *--default-standard-error=*

#+begin_quote
Sets the default output or error output for all services and sockets,
respectively. See /systemd.default_standard_output=/ and
/systemd.default_standard_error=/ above.

#+end_quote

* SOCKETS AND FIFOS
/run/systemd/notify

#+begin_quote
Daemon status notification socket. This is an *AF_UNIX* datagram socket
and is used to implement the daemon notification logic as implemented by
*sd_notify*(3).

#+end_quote

/run/systemd/private

#+begin_quote
Used internally as communication channel between *systemctl*(1) and the
systemd process. This is an *AF_UNIX* stream socket. This interface is
private to systemd and should not be used in external projects.

#+end_quote

/dev/initctl

#+begin_quote
Limited compatibility support for the SysV client interface, as
implemented by the systemd-initctl.service unit. This is a named pipe in
the file system. This interface is obsolete and should not be used in
new applications.

#+end_quote

* HISTORY
systemd 252

#+begin_quote
Kernel command-line arguments /systemd.unified_cgroup_hierarchy/ and
/systemd.legacy_systemd_cgroup_controller/ were deprecated. Please
switch to the unified cgroup hierarchy.

Added in version 252.

#+end_quote

* SEE ALSO
The *systemd Homepage*[8], *systemd-system.conf*(5), *locale.conf*(5),
*systemctl*(1), *journalctl*(1), *systemd-notify*(1), *daemon*(7),
*sd-daemon*(3), *org.freedesktop.systemd1*(5), *systemd.unit*(5),
*systemd.special*(7), *pkg-config*(1), *kernel-command-line*(7),
*bootup*(7), *systemd.directives*(7)

For more information about the concepts and ideas behind systemd, please
refer to the *Original Design Document*[9].

