public/man/man1/systemd.1/index.html
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Introspection and debugging options
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Those options are used for testing and introspection, and <strong>systemd</strong> may
be invoked with them at any time:</p>
<p>
<strong>–dump-configuration-items</strong></p>
<blockquote>
<p>Dump understood unit configuration items. This outputs a terse but
complete list of configuration items understood in unit definition
files.</p>
</blockquote>
<p>
<strong>–dump-bus-properties</strong></p>
<blockquote>
<p>Dump exposed bus properties. This outputs a terse but complete list of
properties exposed on D-Bus.</p>
<p>
Added in version 239.</p>
</blockquote>
<p>
<strong>–test</strong></p>
<blockquote>
<p>Determine the initial start-up transaction (i.e. the list of jobs
enqueued at start-up), dump it and exit — without actually executing
any of the determined jobs. This option is useful for debugging only.
Note that during regular service manager start-up additional units not
shown by this operation may be started, because hardware, socket, bus or
other kinds of activation might add additional jobs as the transaction
is executed. Use <strong>–system</strong> to request the initial transaction of the
system service manager (this is also the implied default), combine with
<strong>–user</strong> to request the initial transaction of the per-user service
manager instead.</p>
</blockquote>
<p>
<strong>–system</strong>, <strong>–user</strong></p>
<blockquote>
<p>When used in conjunction with <strong>–test</strong>, selects whether to calculate the
initial transaction for the system instance or for a per-user instance.
These options have no effect when invoked without <strong>–test</strong>, as during
regular (i.e. non-<strong>–test</strong>) invocations the service manager will
automatically detect whether it shall operate in system or per-user
mode, by checking whether the PID it is run as is 1 or not. Note that it
is not supported booting and maintaining a system with the service
manager running in <strong>–system</strong> mode but with a PID other than 1.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Print a short help text and exit.</p>
</blockquote>
<p>
<strong>–version</strong></p>
<blockquote>
<p>Print a short version string and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Options that duplicate kernel command line settings
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>Those options correspond directly to options listed above in &#34;Kernel
Command Line&#34;. Both forms may be used equivalently for the system
manager, but it is recommended to use the forms listed above in this
context, because they are properly namespaced. When an option is
specified both on the kernel command line and as a normal command line
argument, the latter has higher precedence.</p>
<p>
When <strong>systemd</strong> is used as a user manager, the kernel command line is
ignored and only the options described below are understood.
Nevertheless, <strong>systemd</strong> is usually started in this mode through the
*user@.service*(5) service, which is shared between all users. It may be
more convenient to use configuration files to modify settings (see
*systemd-user.conf*(5)), or environment variables. See the &#34;Environment&#34;
section above for a discussion of how the environment block is set.</p>
<p>
<strong>–unit=</strong></p>
<blockquote>
<p>Set default unit to activate on startup. If not specified, defaults to
default.target. See <em>systemd.unit=</em> above.</p>
</blockquote>
<p>
<strong>–dump-core</strong></p>
<blockquote>
<p>Enable core dumping on crash. This switch has no effect when running as
user instance. Same as <em>systemd.dump_core=</em> above.</p>
</blockquote>
<p>
*–crash-vt=*/VT/</p>
<blockquote>
<p>Switch to a specific virtual console (VT) on crash. This switch has no
effect when running as user instance. Same as <em>systemd.crash_chvt=</em>
above (but not the different spelling!).</p>
<p>
Added in version 227.</p>
</blockquote>
<p>
<strong>–crash-shell</strong></p>
<blockquote>
<p>Run a shell on crash. This switch has no effect when running as user
instance. See <em>systemd.crash_shell=</em> above.</p>
</blockquote>
<p>
<strong>–crash-action=</strong></p>
<blockquote>
<p>Specify what to do when the system manager (PID 1) crashes. This switch
has no effect when systemd is running as user instance. See
<em>systemd.crash_action=</em> above.</p>
<p>
Added in version 256.</p>
</blockquote>
<p>
<strong>–confirm-spawn</strong></p>
<blockquote>
<p>Ask for confirmation when spawning processes. This switch has no effect
when run as user instance. See <em>systemd.confirm_spawn</em> above.</p>
</blockquote>
<p>
<strong>–show-status</strong></p>
<blockquote>
<p>Show terse unit status information on the console during boot-up and
shutdown. See <em>systemd.show_status</em> above.</p>
<p>
Added in version 244.</p>
</blockquote>
<p>
<strong>–log-color</strong></p>
<blockquote>
<p>Highlight important log messages. See <em>systemd.log_color</em> above.</p>
<p>
Added in version 244.</p>
</blockquote>
<p>
<strong>–log-level=</strong></p>
<blockquote>
<p>Set log level. See <em>systemd.log_level</em> above.</p>
</blockquote>
<p>
<strong>–log-location</strong></p>
<blockquote>
<p>Include code location in log messages. See <em>systemd.log_location</em> above.</p>
<p>
Added in version 244.</p>
</blockquote>
<p>
<strong>–log-target=</strong></p>
<blockquote>
<p>Set log target. See <em>systemd.log_target</em> above.</p>
</blockquote>
<p>
<strong>–log-time=</strong></p>
<blockquote>
<p>Prefix console messages with timestamp. See <em>systemd.log_time</em> above.</p>
<p>
Added in version 246.</p>
</blockquote>
<p>
<strong>–machine-id=</strong></p>
<blockquote>
<p>Override the machine-id set on the hard drive. See <em>systemd.machine_id=</em>
above.</p>
<p>
Added in version 229.</p>
</blockquote>
<p>
<strong>–service-watchdogs</strong></p>
<blockquote>
<p>Globally enable/disable all service watchdog timeouts and emergency
actions. See <em>systemd.service_watchdogs</em> above.</p>
<p>
Added in version 237.</p>
</blockquote>
<p>
<strong>–default-standard-output=</strong>, <strong>–default-standard-error=</strong></p>
<blockquote>
<p>Sets the default output or error output for all services and sockets,
respectively. See <em>systemd.default_standard_output=</em> and
<em>systemd.default_standard_error=</em> above.</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
SOCKETS AND FIFOS
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<p>/run/systemd/notify</p>
<blockquote>
<p>Daemon status notification socket. This is an <strong>AF_UNIX</strong> datagram socket
and is used to implement the daemon notification logic as implemented by
*sd_notify*(3).</p>
</blockquote>
<p>
/run/systemd/private</p>
<blockquote>
<p>Used internally as communication channel between <strong>systemctl*(1) and the
systemd process. This is an *AF_UNIX</strong> stream socket. This interface is
private to systemd and should not be used in external projects.</p>
</blockquote>
<p>
/dev/initctl</p>
<blockquote>
<p>Limited compatibility support for the SysV client interface, as
implemented by the systemd-initctl.service unit. This is a named pipe in
the file system. This interface is obsolete and should not be used in
new applications.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-15" class="outline-2">
<h2 id="headline-15">
HISTORY
</h2>
<div id="outline-text-headline-15" class="outline-text-2">
<p>systemd 252</p>
<blockquote>
<p>Kernel command-line arguments <em>systemd.unified_cgroup_hierarchy</em> and
<em>systemd.legacy_systemd_cgroup_controller</em> were deprecated. Please
switch to the unified cgroup hierarchy.</p>
<p>
Added in version 252.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-16" class="outline-2">
<h2 id="headline-16">
SEE ALSO
</h2>
<div id="outline-text-headline-16" class="outline-text-2">
<p>The <strong>systemd Homepage</strong>[8], *systemd-system.conf*(5), *locale.conf*(5),
*systemctl*(1), *journalctl*(1), *systemd-notify*(1), *daemon*(7),
*sd-daemon*(3), *org.freedesktop.systemd1*(5), *systemd.unit*(5),
*systemd.special*(7), *pkg-config*(1), *kernel-command-line*(7),
*bootup*(7), *systemd.directives*(7)</p>
<p>
For more information about the concepts and ideas behind systemd, please
refer to the <strong>Original Design Document</strong>[9].</p>
</div>
</div>
