content/man/man1/systemd.1.org
* NOTES
-  1. :: Interface Portability and Stability Promise

  https://systemd.io/PORTABILITY_AND_STABILITY/

-  2. :: Container Interface

  https://systemd.io/CONTAINER_INTERFACE

-  3. :: initrd Interface

  https://systemd.io/INITRD_INTERFACE/

-  4. :: Control Groups v2

  https://docs.kernel.org/admin-guide/cgroup-v2.html

-  5. :: XDG Base Directory specification

  https://standards.freedesktop.org/basedir-spec/basedir-spec-latest.html

-  6. :: Known Environment Variables

  https://systemd.io/ENVIRONMENT

-  7. :: System and Service Credentials

  https://systemd.io/CREDENTIALS

-  8. :: systemd Homepage

  https://systemd.io/

-  9. :: Original Design Document

  https://0pointer.de/blog/projects/systemd.html
