public/man/man1/systemd.1/index.html
<div id="outline-container-headline-17" class="outline-2">
<h2 id="headline-17">
NOTES
</h2>
<div id="outline-text-headline-17" class="outline-text-2">
<dl>
<dt>
1.
</dt>
<dd>Interface Portability and Stability Promise

https://systemd.io/PORTABILITY_AND_STABILITY/</dd>
<dt>
2.
</dt>
<dd>Container Interface

https://systemd.io/CONTAINER_INTERFACE</dd>
<dt>
3.
</dt>
<dd>initrd Interface

https://systemd.io/INITRD_INTERFACE/</dd>
<dt>
4.
</dt>
<dd>Control Groups v2

https://docs.kernel.org/admin-guide/cgroup-v2.html</dd>
<dt>
5.
</dt>
<dd>XDG Base Directory specification

https://standards.freedesktop.org/basedir-spec/basedir-spec-latest.html</dd>
<dt>
6.
</dt>
<dd>Known Environment Variables

https://systemd.io/ENVIRONMENT</dd>
<dt>
7.
</dt>
<dd>System and Service Credentials

https://systemd.io/CREDENTIALS</dd>
<dt>
8.
</dt>
<dd>systemd Homepage

https://systemd.io/</dd>
<dt>
9.
</dt>
<dd>Original Design Document

https://0pointer.de/blog/projects/systemd.html</dd>
</dl>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
